{
    "techloop": [
        {
            "title": "Hack the Hackathon",
            "desc": "Conducted in March 2021, this TechLoop was the all-you-need-to-know guide to get started hacking your way through hack season. The event covered a variety of domains ranging from web and app development to design, presentation and branding.",
            "image": "/images/techloop/hth-t.svg"
        },
        {
            "title": "Robotics",
            "desc": "Our TechLoop on Robotics was an introductory session to robotics, and its practical applications in a variety of fields.",
            "image": "/images/techloop/robotics-t.svg"
        },
        {
            "title": "Web Development",
            "desc": "Our third TechLoop of 2021, delved into Web Development, taking attendees through the basics of developing websites, from pitch-perfect frontend to seamless, efficient code written for the backend. It covered the MERN stack, consisting of MongoDB, Express, React.js and Node.",
            "image": "/images/techloop/webdev-t.svg"
        },
        {
            "title": "App Development",
            "desc": "This TechLoop session covered the basics of app development, featuring mini follow-along projects in native Android and iOS with both UIKit and SwiftUI, as well as introductions to cross-platform app frameworks like Flutter and Dart.",
            "image": "/images/techloop/appdev-t.svg"
        },
        {
            "title": "Game Development",
            "desc": "Video games blur the line between reality and fiction. This TechLoop delved deep into game development and the manner in which it evolved with the times, after which attendees were taught how to make a game from scratch!",
            "image": "/images/techloop/gamedev-t.svg"
        },
        {
            "title": "Blockchain",
            "desc": "If blockchain has ever intrigued you, but you don’t know where to start, this TechLoop has got you covered! Starting from the basics, we went through the core concepts, the transaction lifestyle of crypto transactions and the difference between Bitcoin and blockchain!",
            "image": "/images/techloop/blockchain-t.svg"
        
        },
        {
            "title": "Cybersecurity",
            "desc": "Real-life hackers may not be wearing a black hoodie and sitting in a dark room but it sounds so cool. Did you know that it's legal? Ethical hacking, of course! Cybersecurity is integral to protecting your system from harm. This TechLoop covered cybersecurity, cyber-attacks, tools used, how ethical hacking works, and so much more!",
            "image": "/images/techloop/cybersec-t.svg"
        }
    ],
    "events": [
        {
            "title": "Enigma 8.0",
            "desc": "The 8th edition of our annual cryptic hunt, Enigma saw 2400+ participants from over 74 countries come together for 48 hours to solve cryptic riddles that led them from Egyptian mythology to the farthest corners of the Internet, solving puzzles and decoding ciphers along the way. With a prize pool of ₹1,00,000, the event was a massive success. To this date, Enigma remains unsolved.",
            "image": "/images/enigma.svg"
        },
        {
            "title": "Fossfiesta",
            "desc": "FOSSFiesta, commonly known as the free and open source software party, was organised by IEEE-VIT and consisted of two sessions: Open Source Takeover and Git-Set-Go. All questions about open source, Hacktoberfest, GitHub, and Git were addressed and resolved, culminating in a fantastic codesprint competition with fantastic prizes.",
            "image": "/images/foss.svg"
        },
        {
            "title": "Palette ‘21",
            "desc": "Palette 2021 was a 48-hour online design hack that put your creativity to the test! With randomly generated problem statements and a prize pool worth ₹60,000, the pressure was on all teams to wow our expert panel of judges with their product. And with 500+ registrations from over 65 countries, this one-of-a-kind event was nothing short of a success.",
            "image": "/images/palatte.svg"
        },
        {
            "title": "Hacktoberfest",
            "desc": "Hacktoberfest is a month-long celebration of open-source projects, their maintainers, and the entire community of contributors. IEEE-VIT promotes open-sourcing and creates repositories for beginners to contribute.",
            "image": "/images/hacktoberfest.svg"
        },
        {
            "title": "Odyssey",
            "desc": "Odyssey was a 36 hour sci-fi based, beginner friendly, no code hackathon which allowed the participants to unlock their creative spirits and the will to learn and explore!",
            "image": "/images/odyssey.svg"
        },
        {
            "title": "Hack the Hackathon",
            "desc": "Hack the Hackathon was a all-you-need-to-know guide session on hackathons. It was to guide beginners in their hackathon journey while making it smoother.",
            "image": "/images/HTH.svg"
        },
        {
            "title": "Techloop Alpha",
            "desc": "Techloop Alpha was the perfect starting point for anyone stepping into the world of tech. IEEE-VIT curated 10 different domains of tech, from WebDev to Quantum Computing, to help anyone decide which domain excites them the most.",
            "image": "/images/Techloop.svg"
        }

    ],
    "blogs": [
        {
            "title": "Composing CTF Challenges",
            "desc": "CTF stands for Capture The Flag, it is a competition that tests out your cybersecurity skills in the form of various challenges.",
            "image": "/images/medium/pod1.svg",
            "link": "https://medium.com/techloop/composing-ctf-challenge-b5828dba0feb"
        },
        {
            "title": "Hosting CTF challenges on a Kubernetes cluster",
            "desc": "In this article, we will be walking through how to host CTF challenges, reachable via HTTP(s) and TCP on a k8s cluster.",
            "image": "/images/medium/pod2.svg",
            "link": "https://medium.com/techloop/hosting-ctf-challenges-on-a-kubernetes-cluster-f0f7441c3cd0"
        },
        {
            "title": "CTF challenges: Dockerizing and Repository structure",
            "desc": "In this article we’ll be exploring how we can dockerize common CTF challenges and and nice way to structure the repo containing all challenges.",
            "image": "/images/medium/pod3.svg",
            "link": "https://medium.com/techloop/ctf-challenges-dockerizing-and-repository-structure-bd3aed9314de"
        },
        {
            "title": "Infra overview and planning: IEEECTF 2020",
            "desc": "We at IEEE-VIT conducted a 36 hour CTF from 31st October 2020 to 2nd November 2020, with a variety of different challenges aimed at beginners and enthusiasts. All the experience and learnings from this are going to be reflected in this blog.",
            "image": "/images/medium/pod4.svg",
            "link": "https://medium.com/techloop/infra-overview-and-planning-ieeectf-2020-555589505848"
        },
        {
            "title": "How to make an interactive globe using three.js",
            "desc": "In this blog we will see how to make a cool looking globe like one shown in banner photo with different flavors and customizations for same.",
            "image": "/images/medium/pod5.svg",
            "link": "https://medium.com/techloop/composing-ctf-challenge-b5828dba0feb"
        },
        {
            "title": "Understanding Kyverno Policies",
            "desc": "Are you looking to write PSPs for your Kubernetes cluster in the easiest way possible without learning a new language? Say Ki to Kyverno.",
            "image": "/images/medium/pod6.svg",
            "link": "https://medium.com/techloop/understanding-kyverno-policies-7e2d8651d7b1"
        },
        {
            "title": "How to get started on Design Projects",
            "desc": "You’ve figured out which domain of design you want to explore, downloaded all the software you need, and watched countless tutorials to get familiar with them. But now what? How do you start with your own projects?At the end of this article, you should have the answers to those questions.",
            "image": "/images/medium/pod7.svg",
            "link": "https://medium.com/techloop/how-to-get-started-on-design-projects-cee0104583cc"
        }
    ],
    "podcast": [
        {
            "title": "The Techloop Podcast with IEEE",
            "desc": "Presenting: The techloop podcast with IEEE-VIT.",
            "image": "/images/medium/techloop-podcast.svg",
            "link": "https://open.spotify.com/episode/2gnJVNjnYATQFPmf1W1faG?si=f24bff0a71a84078"
        },
        {
            "title": "PODCAST EPISODE: 1",
            "desc": "Join the very first IEEE-VIT podcast with Saptarshi Prakash the current Director of Design at Swiggy India as he discusses his creative process, gives his insight about the industry and advice for all.",
            "image": "/images/podcasts/podcast1.svg",
            "link": "https://open.spotify.com/episode/5DhWBioSoMeRfQFdfAI7Vh?si=98401bd7e8c64c0b"
        },
        {
            "title": "PODCAST EPISODE: 2",
            "desc": "Ajeet Singh Raina a Docker Captains shares with us his tech journey, thoughts and opinions about the current and future scenario of cloud related tech.",
            "image": "/images/podcasts/podcast2.svg",
            "link": "https://open.spotify.com/episode/4zheYbIWjpBmV8Yewy14Q1?si=f0cd6e3b36ac4f24"
        },
        {
            "title": "PODCAST EPISODE: 3",
            "desc": "Know future of cross platform development with IEEE-VIT and Jeroen Meijer a Flutter Google developer expert.",
            "image": "/images/podcasts/podcast3.svg",
            "link": "https://open.spotify.com/episode/5dIFwf3mK7Sab67vH8RVjM?si=a218db1bd3a2424e"
        },
        {
            "title": "PODCAST EPISODE: 4",
            "desc": "Join in to be enthralled by Geetika Batra and her journey through Opensource ,her expertise in various technologies like Docker, Kubernetes & OpenShift, which will help you get started in no time!",
            "image": "/images/podcasts/podcast4.svg",
            "link": "https://open.spotify.com/episode/6abW4kPpOnWTYiw1TsIjgf?si=9f68dfe92840457a"
        },
        {
            "title": "PODCAST EPISODE: 5",
            "desc": "With a decade-long experience in programming and industrial exposure, Ankit Mahato takes us on his journey through Machine Learning, Open Source, and much more to help you get started.",
            "image": "/images/podcasts/podcast5.svg",
            "link": "https://open.spotify.com/episode/5cMm0220cQnyw1RvPkIxqI?si=2ec57fc7a1b942cb"
        },
        {
            "title": "PODCAST EPISODE: 6",
            "desc": "Join our conversation with Dipanjan Sarkar, a Google Developer Expert in Data Science and Machine Learning, as he discusses the future of data science and how you can participate in it.",
            "image": "/images/podcasts/podcast6.svg",
            "link": "https://open.spotify.com/episode/3AF1dmyz7NTxwUrLtJOL0E?si=6dc73458fb894f30"
        },{
            "title": "PODCAST EPISODE: 7",
            "desc": "Join us in our conversation with Vaidheeswaran Archana, an AI engineer at Continental. Find out answers to questions like how much math do you have to know? What kind of projects can we do with ML? and much more.",
            "image": "/images/podcasts/podcast7.svg",
            "link": "https://open.spotify.com/episode/6yFuO3mLsWtvYldqF4ZxuO?si=6e7ba4338da3443e"
        },{
            "title": "PODCAST EPISODE: 8",
            "desc": "Join our conversation with Ankit Garg, a Lead Android Developer at Microsoft, as he shares his insights on innovative hacks that can transform your perspective on the world of Android.",
            "image": "/images/podcasts/podcast8.svg",
            "link": "https://open.spotify.com/episode/3HXqt5Rb2jLqtmmc9ww77Z?si=156eaa7d17604849"
        },{
            "title": "PODCAST EPISODE: 9",
            "desc": "Tune in to hear Pavan Podila, an accomplished open-source developer, as he shares his inspiring journey from working with Flutter and 3D design to developing an Open Source library.",
            "image": "/images/podcasts/podcast9.svg",
            "link": "https://open.spotify.com/episode/3PKrW1XXqhweg5oZn6Qskr?si=0238bb56fabd4b15"
        },{
            "title": "PODCAST EPISODE: 10",
            "desc": "Engage in a conversation with Tanvi Patel as she shares her journey, from exploring web development during her college days to obtaining a Master's degree in the United States, and her current work at Uber.",
            "image": "/images/podcasts/podcast10.svg",
            "link": "https://open.spotify.com/episode/1SgXMm8s9gzIQjexIR6clD?si=42e4bf5350f44ad1"
        }
    ],
    "domains": [
        {
            "domain_name": "Electronics",
            "domain_icon": "electronics.svg"
        },
        {
            "domain_name": "Machine Learning",
            "domain_icon": "ml.svg"
        },
        {
            "domain_name": "Design",
            "domain_icon": "design.svg"
        },
        {
            "domain_name": "Competitive Coding",
            "domain_icon": "cc.svg"
        },
        {
            "domain_name": "Web Development",
            "domain_icon": "web_development.svg"
        },
        {
            "domain_name": "App Development",
            "domain_icon": "app_development.svg"
        },
        {
            "domain_name": "Blockchain",
            "domain_icon": "blockchain.svg"
        },
        {
            "domain_name": "Cybersecurity",
            "domain_icon": "cybersecurity.svg"
        },
        {
            "domain_name": "AR/VR",
            "domain_icon": "ar_vr.svg"
        },
        {
            "domain_name": "Game Development",
            "domain_icon": "game_development.svg"
        }
    ],
    "board": [
        {
            "name": "Kavipriya A",
            "pos": "Chairperson",
            "img": "Kavipriya"
        },
        {
            "name": "Akshaya Chelliah",
            "pos": "Vice Chairperson",
            "img": "Akshaya"
        },
        {
            "name": "Anshita Bala",
            "pos": "Management Head",
            "img": "Anshita"
        },
        {
            "name": "Harsh Gupta",
            "pos": "Technical Head",
            "img": "Harsh"
        },
        {
            "name": "Varun Murpani",
            "pos": "Internal Affairs Lead",
            "img": "Varun"
        },
        {
            "name": "Vibhuti Arora",
            "pos": "Marketing Lead",
            "img": "Vibhuti"
        },
        {
            "name": "Jatin Fulwani",
            "pos": "Outreach Lead",
            "img": "Jatin"
        },
        {
            "name": "Aneesh Panda",
            "pos": "DevRel Lead",
            "img": "Aneesh"
        },
        {
            "name": "Mayank Sharma",
            "pos": "Projects Lead",
            "img": "Mayank"
        },
        {
            "name": "Alok Naushad",
            "pos": "Open-source Lead",
            "img": "Alok"
        }
    ]
}